OdDbBaseLayerPE.getLineType(OdRxObject*,OdGiLinetype*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the current linetype for the specified layer.
\param obj    [in]  A pointer to a layer object.
\param LType  [out] An object of the OdGiLinetype class to store and return the information about layer's linetype.
\returns Returns true if the linetype has been successfully retrieved from the layer object, otherwise returns false.

OdDbBaseLayerPE.setIsFrozen(OdRxObject*,System.Boolean)
\details
Sets the frozen status of this Layer.
\param obj    [in]  A pointer to a layer object.
\param frozen [in]  A new frozen status value (true to freeze, false to thaw).

OdDbBaseLayerPE.setIsOff(OdRxObject*,System.Boolean)
\details
Sets the on / off status of this Layer.
\param obj [in]  A pointer to a layer object.
\param off [in]  A new on / off status value (true for off, false for on).

OdDbBaseLayerPE.isFrozen(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Determines whether a specified layer is frozen.
\param obj [in]  A pointer to a layer object.
\returns Returns true if the layer is frozen, otherwise returns false.

OdDbBaseLayerPE.isOff(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Determines whether a specified layer object is off.
\param obj [in]  A pointer to a layer object.
\returns Returns true if the layer is off, otherwise returns false.

OdDbBaseLayerPE.name(OdRxObject!System.Runtime.CompilerServices.IsConst*,OdGiAuxiliaryData*)
\details
Returns the name of a specified layer object.
\param obj [in]  A pointer to a layer object.
\param pAuxData [in]  A pointer to a auxiliary layer data.
\returns the name of a specified layer object.

OdDbBaseLayerPE.name(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Returns the name of a specified layer object.
\param obj [in]  A pointer to a layer object.